INSERT INTO Institutions (institution_name, institution_type, address) VALUES
    ('Школа №1', 'School', 'вул. Шевченка, 10, Київ'),
    ('Сонечко', 'Kindergarten', 'вул. Соняшникова, 5, Київ'),
    ('ХВПКУ', 'Sharaga', 'вул. Інноваційна, 25, Київ');

INSERT INTO Classes (class_name, institution_id, direction) VALUES
    ('5-А', 1, 'Математика'),
    ('Група "Сніжинки"', 2, 'Мова'),
    ('ККТ-18', 3, 'Технологія'),
    ('7-В', 1, 'Мова'),
    ('Група "Метелики"', 2, 'Математика');

INSERT INTO Children (first_name, last_name, birth_date, year_of_entry, age, institution_id, class_id) VALUES
    ('Іван', 'Петренко', '2013-05-15', 2020, 10, 1, 1),
    ('Марія', 'Коваленко', '2018-09-10', 2022, 5, 2, 2),
    ('Олександр', 'Шевчук', '2010-03-22', 2018, 13, 3, 3),
    ('Софія', 'Мельник', '2012-11-08', 2019, 11, 1, 4),
    ('Михайло', 'Бондаренко', '2019-01-30', 2023, 4, 2, 5),
    ('Анастасія', 'Ткаченко', '2009-07-17', 2017, 14, 3, 3);

INSERT INTO Parents (first_name, last_name, child_id, tuition_fee) VALUES
    ('Олег', 'Петренко', 1, 5000.00),
    ('Наталія', 'Петренко', 1, 5000.00),
    ('Ірина', 'Коваленко', 2, 3500.00),
    ('Андрій', 'Шевчук', 3, 6000.00),
    ('Світлана', 'Шевчук', 3, 6000.00),
    ('Василь', 'Мельник', 4, 4800.00),
    ('Тетяна', 'Бондаренко', 5, 3200.00),
    ('Максим', 'Ткаченко', 6, 5500.00);